[Killed] BlockStatement
main/components/Courses/CoursesTable.js:28:37
      // Stryker disable next-line all : TODO try to make a good test for this
      const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-     const joinCallBack = (cell) => {
-        onJoinClick(cell.row.values.id);
-    };
+     const joinCallBack = (cell) => {};
 
      const columns = [
killedBy: UserTable tests Join button calls the callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:63:89
          },
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Join", undefined, joinCallBack, "CoursesTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
      return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
