[Killed] BlockStatement
main/components/Courses/CoursesTable.js:67:11
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
-     else {
-         columns.push(ButtonColumn("Join", undefined, joinCallBack, "CoursesTable"));
-     }
+     else {}
 
      return <OurTable
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:68:69
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
      else {
-         columns.push(ButtonColumn("Join", undefined, joinCallBack, "CoursesTable"));
+         columns.push(ButtonColumn("Join", undefined, joinCallBack, ""));
      }
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
