[Survived] ObjectLiteral
main/components/Users/UsersTable.js:8:26
 import { useBackendMutation } from "main/utils/useBackend";
 
 const ConfirmationModal = ({ isOpen, onClose, onConfirm, message }) => {
-    const customStyles = {
-        content: {
-        top: "50%",
-        left: "50%",
-        right: "auto",
-        bottom: "auto",
-        marginRight: "-50%",
-        transform: "translate(-50%, -50%)",
-        width: "50%", // Adjust the width as needed
-        maxWidth: "400px", // Limit the maximum width
-        padding: "20px",
-        borderRadius: "8px",
-        boxShadow: "0 4px 8px rgba(0, 0, 0, 0.2)",
-        background: "#fff",
-        },
-        overlay: {
-        background: "rgba(0, 0, 0, 0.5)",
-        },
-    };
+    const customStyles = {};
     
     return (

[Survived] ObjectLiteral
main/components/Users/UsersTable.js:9:18
 
 const ConfirmationModal = ({ isOpen, onClose, onConfirm, message }) => {
     const customStyles = {
-        content: {
-        top: "50%",
-        left: "50%",
-        right: "auto",
-        bottom: "auto",
-        marginRight: "-50%",
-        transform: "translate(-50%, -50%)",
-        width: "50%", // Adjust the width as needed
-        maxWidth: "400px", // Limit the maximum width
-        padding: "20px",
-        borderRadius: "8px",
-        boxShadow: "0 4px 8px rgba(0, 0, 0, 0.2)",
-        background: "#fff",
-        },
+        content: {},
         overlay: {
         background: "rgba(0, 0, 0, 0.5)",

[Survived] StringLiteral
main/components/Users/UsersTable.js:10:14
 const ConfirmationModal = ({ isOpen, onClose, onConfirm, message }) => {
     const customStyles = {
         content: {
-        top: "50%",
+        top: "",
         left: "50%",
         right: "auto",

[Survived] StringLiteral
main/components/Users/UsersTable.js:11:15
     const customStyles = {
         content: {
         top: "50%",
-        left: "50%",
+        left: "",
         right: "auto",
         bottom: "auto",

[Survived] StringLiteral
main/components/Users/UsersTable.js:13:17
         top: "50%",
         left: "50%",
         right: "auto",
-        bottom: "auto",
+        bottom: "",
         marginRight: "-50%",
         transform: "translate(-50%, -50%)",

[Survived] StringLiteral
main/components/Users/UsersTable.js:15:20
         right: "auto",
         bottom: "auto",
         marginRight: "-50%",
-        transform: "translate(-50%, -50%)",
+        transform: "",
         width: "50%", // Adjust the width as needed
         maxWidth: "400px", // Limit the maximum width

[Survived] StringLiteral
main/components/Users/UsersTable.js:16:16
         bottom: "auto",
         marginRight: "-50%",
         transform: "translate(-50%, -50%)",
-        width: "50%", // Adjust the width as needed
+        width: "", // Adjust the width as needed
         maxWidth: "400px", // Limit the maximum width
         padding: "20px",

[Survived] StringLiteral
main/components/Users/UsersTable.js:19:23
         width: "50%", // Adjust the width as needed
         maxWidth: "400px", // Limit the maximum width
         padding: "20px",
-        borderRadius: "8px",
+        borderRadius: "",
         boxShadow: "0 4px 8px rgba(0, 0, 0, 0.2)",
         background: "#fff",

[Survived] StringLiteral
main/components/Users/UsersTable.js:24:21
         background: "#fff",
         },
         overlay: {
-        background: "rgba(0, 0, 0, 0.5)",
+        background: "",
         },
     };

[Survived] BooleanLiteral
main/components/Users/UsersTable.js:43:72
 };
 
 export default function UsersTable({ users, showToggleButtons = false }) {
-    const [confirmationModalOpen, setConfirmationModalOpen] = useState(false);
+    const [confirmationModalOpen, setConfirmationModalOpen] = useState(true);
     const [selectedCell, setSelectedCell] = useState(null);
 

[Killed] BooleanLiteral
main/components/Users/UsersTable.js:68:34
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async (cell) => {
         setSelectedCell(cell);
-        setConfirmationModalOpen(true);
+        setConfirmationModalOpen(false);
       };
     
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: TestingLibraryElementError: Unable to find an element with the text: Yes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Users/UsersTable.js:71:48
         setConfirmationModalOpen(true);
       };
     
-      const handleToggleAdminConfirmed = () => {
-        setConfirmationModalOpen(false);
-        toggleAdminMutation.mutate(selectedCell);
-    };
+      const handleToggleAdminConfirmed = () => {};
 
     // toggleInstructor
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Survived] BooleanLiteral
main/components/Users/UsersTable.js:72:34
       };
     
       const handleToggleAdminConfirmed = () => {
-        setConfirmationModalOpen(false);
+        setConfirmationModalOpen(true);
         toggleAdminMutation.mutate(selectedCell);
     };

[Killed] BlockStatement
main/components/Users/UsersTable.js:101:53
         setConfirmationModalOpen(true);
       };
     
-      const handleToggleInstructorConfirmed = () => {
-        setConfirmationModalOpen(false);
-        toggleInstructorMutation.mutate(selectedCell);
-    };
+      const handleToggleInstructorConfirmed = () => {};
 
     const columns = [
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Survived] BooleanLiteral
main/components/Users/UsersTable.js:102:34
       };
     
       const handleToggleInstructorConfirmed = () => {
-        setConfirmationModalOpen(false);
+        setConfirmationModalOpen(true);
         toggleInstructorMutation.mutate(selectedCell);
     };

[Survived] ArrowFunction
main/components/Users/UsersTable.js:154:22
           />
           <ConfirmationModal
             isOpen={confirmationModalOpen}
-            onClose={() => setConfirmationModalOpen(false)}
+            onClose={() => undefined}
             onConfirm={handleToggleAdminConfirmed}
             message="Are you sure you want to toggle this user's admin role?"

[Survived] BooleanLiteral
main/components/Users/UsersTable.js:154:53
           />
           <ConfirmationModal
             isOpen={confirmationModalOpen}
-            onClose={() => setConfirmationModalOpen(false)}
+            onClose={() => setConfirmationModalOpen(true)}
             onConfirm={handleToggleAdminConfirmed}
             message="Are you sure you want to toggle this user's admin role?"
