[Killed] BlockStatement
main/components/Users/UsersTable.js:8:47
 
 export default function UsersTable({ users, showToggleButtons = false }) {
   // toggleAdmin
-  function cellToAxiosParamsToggleAdmin(cell) {
-    return {
-      url: "/api/admin/users/toggleAdmin",
-      method: "POST",
-      params: {
-        githubId: cell.row.values.githubId,
-      },
-    };
-  }
+  function cellToAxiosParamsToggleAdmin(cell) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:9:12
 export default function UsersTable({ users, showToggleButtons = false }) {
   // toggleAdmin
   function cellToAxiosParamsToggleAdmin(cell) {
-    return {
-      url: "/api/admin/users/toggleAdmin",
-      method: "POST",
-      params: {
-        githubId: cell.row.values.githubId,
-      },
-    };
+    return {};
   }
 
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:36:15
     return {
       url: "/api/admin/users/toggleInstructor",
       method: "POST",
-      params: {
-        githubId: cell.row.values.githubId,
-      },
+      params: {},
     };
   }
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "githubId": 11111,
- }

[Killed] StringLiteral
main/components/Users/UsersTable.js:61:15
       accessor: "githubId", // accessor is the "key" in the data
     },
     {
-      Header: "githubLogin",
+      Header: "",
       accessor: "githubLogin", // accessor is the "key" in the data
     },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: githubLogin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block

[Killed] StringLiteral
main/components/Users/UsersTable.js:65:15
       accessor: "githubLogin", // accessor is the "key" in the data
     },
     {
-      Header: "fullName",
+      Header: "",
       accessor: "fullName",
     },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: fullName. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Users/UsersTable.js:74:11
     },
     {
       Header: "Last Online",
-      id: "lastOnline",
+      id: "",
       accessor: (row) => formatTime(row.lastOnline),
     },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-lastOnline"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Users/UsersTable.js:84:11
     },
     {
       Header: "Instructor",
-      id: "instructor",
+      id: "",
       accessor: (row, _rowIndex) => String(row.instructor), // hack needed for boolean values to show up
     },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-instructor"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Users/UsersTable.js:103:15
     <OurTable
       data={users}
       columns={showToggleButtons ? buttonColumn : columns}
-      testid={"UsersTable"}
+      testid={""}
     />
   );
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-githubId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
