[Killed] BooleanLiteral
main/components/Users/UsersTable.js:48:80
 
   // Stryker disable next-line all : TA told me to
   const [InstructorConfirmationModalOpen, setInstructorConfirmationModalOpen] = useState(false);
-  const [AdminConfirmationModalOpen, setAdminConfirmationModalOpen] = useState(false);
+  const [AdminConfirmationModalOpen, setAdminConfirmationModalOpen] = useState(true);
   const [selectedCell, setSelectedCell] = useState(null);
 
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: TestingLibraryElementError: Found multiple elements with the text: Yes

Here are the matching elements:

<button>
  Yes
</button>

[Killed] BlockStatement
main/components/Users/UsersTable.js:77:46
       setAdminConfirmationModalOpen(true);
     };
 
-    const handleToggleAdminConfirmed = () => {
-      // Stryker disable next-line all : TA told me to
-      setAdminConfirmationModalOpen(false);
-      toggleAdminMutation.mutate(selectedCell);
-  };
+    const handleToggleAdminConfirmed = () => {};
 
   // toggleInstructor
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] BlockStatement
main/components/Users/UsersTable.js:84:52
   };
 
   // toggleInstructor
-  function cellToAxiosParamsToggleInstructor(cell) {
-    return {
-      url: "/api/admin/users/toggleInstructor",
-      method: "POST",
-      params: {
-        githubId: cell.row.values.githubId,
-      },
-    };
-  }
+  function cellToAxiosParamsToggleInstructor(cell) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] StringLiteral
main/components/Users/UsersTable.js:87:15
   function cellToAxiosParamsToggleInstructor(cell) {
     return {
       url: "/api/admin/users/toggleInstructor",
-      method: "POST",
+      method: "",
       params: {
         githubId: cell.row.values.githubId,
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] BlockStatement
main/components/Users/UsersTable.js:109:51
       setInstructorConfirmationModalOpen(true);
     };
 
-    const handleToggleInstructorConfirmed = () => {
-      // Stryker disable next-line all : TA told me to
-      setInstructorConfirmationModalOpen(false);
-      toggleInstructorMutation.mutate(selectedCell);
-  };
+    const handleToggleInstructorConfirmed = () => {};
 
   const columns = [
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:116:5
   };
 
   const columns = [
-    {
-      Header: "githubId",
-      accessor: "githubId", // accessor is the "key" in the data
-    },
+    {},
     {
       Header: "githubLogin",
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:122:17
     },
     {
       Header: "githubLogin",
-      accessor: "githubLogin", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
     {
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  cgaucho
Received:

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:124:5
       Header: "githubLogin",
       accessor: "githubLogin", // accessor is the "key" in the data
     },
-    {
-      Header: "fullName",
-      accessor: "fullName",
-    },
+    {},
     {
       Header: "Email",
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:138:15
       accessor: (row) => formatTime(row.lastOnline),
     },
     {
-      Header: "Admin",
+      Header: "",
       id: "admin",
       accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-

[Killed] ArrowFunction
main/components/Users/UsersTable.js:145:17
     {
       Header: "Instructor",
       id: "instructor",
-      accessor: (row, _rowIndex) => String(row.instructor), // hack needed for boolean values to show up
+      accessor: () => undefined, // hack needed for boolean values to show up
     },
   ];
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:151:36
 
   const buttonColumn = [
       ...columns,
-      ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
+      ButtonColumn("toggle-admin", "", toggleAdminCallback, "UsersTable"),
       ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
   ]
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
