[Killed] ConditionalExpression
src/main/utils/dateUtils.js:26:9
         return "";
     }
 
-    if (typeof timeString === "number") {
+    if (true) {
         timeString *= 1000;
     }
killedBy: dateUtils tests formatTime tests should NOT multiply by 1000 when input is a string
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "Invalid Date"

[Killed] BlockStatement
src/main/utils/dateUtils.js:26:41
         return "";
     }
 
-    if (typeof timeString === "number") {
-        timeString *= 1000;
-    }
+    if (typeof timeString === "number") {}
 
     const now = new Date();
killedBy: dateUtils tests formatTime tests should multiply by 1000 when input is a number
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "5/23/2022"
Received: "1/19/1970"

[Killed] AssignmentOperator
src/main/utils/dateUtils.js:27:9
     }
 
     if (typeof timeString === "number") {
-        timeString *= 1000;
+        timeString /= 1000;
     }
 
killedBy: dateUtils tests formatTime tests should multiply by 1000 when input is a number
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "5/23/2022"
Received: "12/31/1969"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:45:32
 
     if (secondsPast < dayInSeconds) {
         const hours = Math.floor(secondsPast / 3600);
-        return `${hours} hour${hours > 1 ? 's' : ''} ago`;
+        return `${hours} hour${true ? 's' : ''} ago`;
     }
     
killedBy: dateUtils tests formatTime tests should return 1 hour ago for 1 hour
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1 hour ago"
Received: "1 hours ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:48:9
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
     
-    if (secondsPast < weekInSeconds) {
+    if (secondsPast <= weekInSeconds) {
         const days = Math.floor(secondsPast / 86400);
         return `${days} day${days > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return date string for over a week
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "5/24/2022"
Received: "7 days ago"
