[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:106:67
                             id="startDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
-                            {...register("startDate", { required: true, pattern: isodate_regex, validate: {
+                            {...register("startDate", { required: false, pattern: isodate_regex, validate: {
                                 validateDates: (_, formValues) => {
                                 if (formValues.startDate >= formValues.endDate){
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:106:55
                             id="startDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
-                            {...register("startDate", { required: true, pattern: isodate_regex, validate: {
-                                validateDates: (_, formValues) => {
-                                if (formValues.startDate >= formValues.endDate){
-                                    return "Start Date is greater than or equal to End Date (should be less than End Date).";
-                                }
-                                return null;
-                            }}})}
+                            {...register("startDate", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:107:67
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
                             {...register("startDate", { required: true, pattern: isodate_regex, validate: {
-                                validateDates: (_, formValues) => {
-                                if (formValues.startDate >= formValues.endDate){
-                                    return "Start Date is greater than or equal to End Date (should be less than End Date).";
-                                }
-                                return null;
-                            }}})}
+                                validateDates: (_, formValues) => {}}})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Error messages on bad input (start date is greater than end date)
statusReason: Error: Unable to find an element with the text: /Start Date is greater than or equal to End Date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:108:37
                             isInvalid={Boolean(errors.startDate)}
                             {...register("startDate", { required: true, pattern: isodate_regex, validate: {
                                 validateDates: (_, formValues) => {
-                                if (formValues.startDate >= formValues.endDate){
+                                if (true){
                                     return "Start Date is greater than or equal to End Date (should be less than End Date).";
                                 }
killedBy: CoursesForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:108:37
                             isInvalid={Boolean(errors.startDate)}
                             {...register("startDate", { required: true, pattern: isodate_regex, validate: {
                                 validateDates: (_, formValues) => {
-                                if (formValues.startDate >= formValues.endDate){
+                                if (false){
                                     return "Start Date is greater than or equal to End Date (should be less than End Date).";
                                 }
killedBy: CoursesForm tests Error messages on bad input (start date is greater than end date)
statusReason: Error: Unable to find an element with the text: /Start Date is greater than or equal to End Date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:109:44
                             {...register("startDate", { required: true, pattern: isodate_regex, validate: {
                                 validateDates: (_, formValues) => {
                                 if (formValues.startDate >= formValues.endDate){
-                                    return "Start Date is greater than or equal to End Date (should be less than End Date).";
+                                    return "";
                                 }
                                 return null;
killedBy: CoursesForm tests Error messages on bad input (start date is greater than end date)
statusReason: Error: Unable to find an element with the text: /Start Date is greater than or equal to End Date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/Courses/CoursesForm.js:115:51
                             }}})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && (errors.startDate.type === 'required' ? "StartDate date is required." : errors.startDate.message )}
+                            {errors.startDate && (errors.startDate.type !== 'required' ? "StartDate date is required." : errors.startDate.message )}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:115:30
                             }}})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && (errors.startDate.type === 'required' ? "StartDate date is required." : errors.startDate.message )}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
