[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:115:30
                             }}})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && (errors.startDate.type == 'required' ? "StartDate date is required." : errors.startDate.message )}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/Courses/CoursesForm.js:115:51
                             }}})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && (errors.startDate.type == 'required' ? "StartDate date is required." : errors.startDate.message )}
+                            {errors.startDate && (errors.startDate.type != 'required' ? "StartDate date is required." : errors.startDate.message )}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
