[Killed] BlockStatement
main/components/Utils/SchoolUtils.js:8:48
      toast(message);
  }
 
- export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/school/delete",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
-}
+ export function cellToAxiosParamsDelete(cell) {}
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Utils/SchoolUtils.js:9:13
  }
 
  export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/school/delete",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
+     return {}
 }
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />
