[Killed] BlockStatement
main/components/School/SchoolTable.js:12:37
 
      const navigate = useNavigate();
 
-     const editCallback = (cell) => {
-         navigate(`/school/edit/${cell.row.values.abbrev}`);
-     };
+     const editCallback = (cell) => {};
 
      // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/school/edit/ucsb"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/School/SchoolTable.js:28:37
      // Stryker disable next-line all : TODO try to make a good test for this
      const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-     const joinCallBack = (cell) => {
-        onJoinClick(cell.row.values.abbrev);
-    };
+     const joinCallBack = (cell) => {};
 
      const columns = [
killedBy: UserTable tests Join button calls the callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
main/components/School/SchoolTable.js:33:10
     };
 
      const columns = [
-         {
-             Header: 'Abbrev',
-             accessor: 'abbrev',
-         },
+         {},
          {
              Header: 'Name',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/School/SchoolTable.js:43:24
          },
          {
              Header: 'Term Regex',
-             accessor: 'termRegex',
+             accessor: "",
          },
          {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-termRegex"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/School/SchoolTable.js:55:89
          },
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
-         columns.push(ButtonColumn("Join", undefined, joinCallBack, "SchoolTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
      return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/School/SchoolTable.js:56:44
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
+         columns.push(ButtonColumn("Edit", "", editCallback, "SchoolTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
          columns.push(ButtonColumn("Join", undefined, joinCallBack, "SchoolTable"));
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/School/SchoolTable.js:56:69
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
+         columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
          columns.push(ButtonColumn("Join", undefined, joinCallBack, "SchoolTable"));
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BooleanLiteral
main/components/School/SchoolTable.js:62:16
      }
 
      return <OurTable
-         data={!Array.isArray(school) ? [] : school}
+         data={Array.isArray(school) ? [] : school}
          columns={columns}
          testid={"SchoolTable"} />;
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-abbrev"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrayDeclaration
main/components/School/SchoolTable.js:62:41
      }
 
      return <OurTable
-         data={!Array.isArray(school) ? [] : school}
+         data={!Array.isArray(school) ? ["Stryker was here"] : school}
          columns={columns}
          testid={"SchoolTable"} />;
killedBy: UserTable tests renders empty table when the school returns a NON-JSON object
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="SchoolTable-cell-row-0-col-abbrev" role="cell" /> instead
