[Killed] ArrowFunction
src/main/pages/SchoolCreatePage.js:9:33
 
 export default function SchoolCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/school/post",
-        method: "POST",
-        params: {
-            name: school.name,
-            termRegex: school.termRegex,
-            termDescription: school.termDescription,
-            termError: school.termError,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/SchoolCreatePage.js:9:46
 
 export default function SchoolCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/school/post",
-        method: "POST",
-        params: {
-            name: school.name,
-            termRegex: school.termRegex,
-            termDescription: school.termDescription,
-            termError: school.termError,
-        }
-    });
+    const objectToAxiosParams = (school) => ({});
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/SchoolCreatePage.js:11:17
 
     const objectToAxiosParams = (school) => ({
         url: "/api/school/post",
-        method: "POST",
+        method: "",
         params: {
             name: school.name,
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/SchoolCreatePage.js:20:35
         }
     });
 
-    const onSuccess = (school) => {
-        toast(`New school created - abbrev: ${school.abbrev}`);
-    }
+    const onSuccess = (school) => {}
 
     const mutation = useBackendMutation(
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New school created - abbrev: ucsb"

Number of calls: 0
