[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/school?abbrev=${abbrev}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/school/get`,
-        params: {
-          abbrev
-        }
-      }
+      {}
     );
 
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/school/get`,
-        params: {
-          abbrev
-        }
+        params: {}
       }
     );
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/SchoolEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (school) => ({
-    url: "/api/school/update",
-    method: "PUT",
-    params: {
-      abbrev: school.abbrev,
-      name: school.name,
-      termRegex: school.termRegex,
-      termDescription: school.termDescription,
-      termError: school.termError,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (school) => {
killedBy: SchoolEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/SchoolEditPage.js:26:10
 
 
   const objectToAxiosPutParams = (school) => ({
-    url: "/api/school/update",
+    url: "",
     method: "PUT",
     params: {
killedBy: SchoolEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
