[Killed] BlockStatement
src/main/pages/SchoolIndexPage.js:13:30
 
   const { data: currentUser } = useCurrentUser();
 
-  const createButton = () => {  
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) 
-      return (
-          <Button
-              variant="primary"
-              href="/school/create"
-              style={{ float: "right" }}
-          >
-              Create School 
-          </Button>
-      )
-    
-  }
+  const createButton = () => {}
   
   const { data: school, error: _error, status: _status } =
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create School/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
src/main/pages/SchoolIndexPage.js:14:9
   const { data: currentUser } = useCurrentUser();
 
   const createButton = () => {  
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) 
+    if (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) 
       return (
           <Button
killedBy: SchoolIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create School/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/SchoolIndexPage.js:14:9
   const { data: currentUser } = useCurrentUser();
 
   const createButton = () => {  
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) 
+    if (true) 
       return (
           <Button
killedBy: SchoolIndexPage tests does not render Create Button for ROLE_USER
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="btn btn-primary" href="/school/create" role="button" style="float: right;" tabindex="0">Create School</a> instead

<html>
  <head />
  <body>
    <div>
