[Killed] BlockStatement
main/components/Utils/SchoolUtils.js:8:48
      toast(message);
  }
 
- export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/school/delete",
-         method: "DELETE",
-         params: {
-             abbrev: cell.row.values.abbrev
-         }
-     }
-}
+ export function cellToAxiosParamsDelete(cell) {}
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Utils/SchoolUtils.js:9:13
  }
 
  export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/school/delete",
-         method: "DELETE",
-         params: {
-             abbrev: cell.row.values.abbrev
-         }
-     }
+     return {}
 }
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Utils/SchoolUtils.js:10:15
 
  export function cellToAxiosParamsDelete(cell) {
      return {
-         url: "/api/school/delete",
+         url: "",
          method: "DELETE",
          params: {
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Utils/SchoolUtils.js:11:18
  export function cellToAxiosParamsDelete(cell) {
      return {
          url: "/api/school/delete",
-         method: "DELETE",
+         method: "",
          params: {
              abbrev: cell.row.values.abbrev
killedBy: SchoolIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "School with abbrev: ucsb was deleted"

Number of calls: 0

<html>
  <head />
